In [1]:
# Importar pandas
import pandas as pd

In [2]:
# Cargar mis datos como dataframe
data = pd.read_csv("notes.csv")

In [3]:
type(data)

pandas.core.frame.DataFrame

In [4]:
data

      Nombre  nota
0    Araceli     9
1     Manuel     5
2      Pablo     7
3      Iñigo     4
4      Mario     3
5       Raul     4
6   Verónica     6
7      Dario    10
8      Laura     4
9     Silvia     6
10   Eduardo     2
11    Susana     8
12     María     5

In [5]:
# Visualizar los primeros 5 renglones de mi dataset
data.head()

    Nombre  nota
0  Araceli     9
1   Manuel     5
2    Pablo     7
3    Iñigo     4
4    Mario     3

In [6]:
# Utilizar head con más renglones
data.head(7)

     Nombre  nota
0   Araceli     9
1    Manuel     5
2     Pablo     7
3     Iñigo     4
4     Mario     3
5      Raul     4
6  Verónica     6

In [7]:
# Función que me permite ver la estadistica descriptiva de las columnas numericas de mi dataset
data.describe()

            nota
count  13.000000
mean    5.615385
std     2.364264
min     2.000000
25%     4.000000
50%     5.000000
75%     7.000000
max    10.000000

In [8]:
# USANDO PANDAS
# Calculo de la media
media = data["nota"].mean()
media

5.615384615384615

In [9]:
# Calculo de la mediana
mediana = data["nota"].median()
mediana

5.0

In [11]:
#Calculo de la moda
moda = data["nota"].mode()
moda

0    4
Name: nota, dtype: int64

In [12]:
#Calculo del rango
rango = data["nota"].max() - data["nota"].min()
rango

8

In [13]:
#USANDO NUMPY
import numpy as np

In [14]:
np.mean(data["nota"])

5.615384615384615

In [15]:
np.median(data["nota"])

5.0

In [16]:
#Agregar varianza y desviación estandar
peyitos = [600,470,170,430,300]
np.mean(peyitos)

394.0

In [17]:
np.median(peyitos)

430.0

In [18]:
np.var(peyitos)

21704.0

In [19]:
np.std(peyitos)

147.32277488562318